In [3]:
import pandas as pd

In [14]:
pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 1. How many male and female passengers were onboard?

In [15]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [16]:
len(df[df["Sex"] == "male"])

577

In [17]:
len(df[df["Sex"] == "female"])

314

In [19]:
df.groupby(df["Sex"]).size()

Sex
female    314
male      577
dtype: int64

# 2. How many survived?

In [20]:
df["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [24]:
df["Survived"].describe()

count    891.000000
mean       0.383838
std        0.486592
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Survived, dtype: float64

In [21]:
len(df[df["Survived"]==1])

342

# 3. How many casualities?

In [26]:
len(df[df["Survived"]==0])

549

# 4. What is the name of the oldest person?

In [30]:
df["Age"].max()

80.0

In [29]:
df[df["Age"] == 80]["Name"]

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

# 5.How many passengers we have in 1st, 2nd and 3rd class?

In [31]:
df["Pclass"].describe()

count    891.000000
mean       2.308642
std        0.836071
min        1.000000
25%        2.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

In [33]:
len(df[df["Pclass"]==1])

216

In [36]:
len(df[df["Pclass"]==2])

184

In [35]:
len(df[df["Pclass"]==3])

491

In [37]:
df.groupby(df["Pclass"]).size()

Pclass
1    216
2    184
3    491
dtype: int64

# 6. How many passengers we have with name starting with letter "s"

In [42]:
search = "S"
len(df[df["Name"].str.startswith(search)])

86

# 7. Create a new column which is a summation of "SibSp" and "Parch"

In [53]:
df["Sum_SibSp_Parch"] = df["SibSp"] + df["Parch"]

In [54]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SumSibPa,Sum_Sibsa_Parch,Sum_SibSp_Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,0

# 8. How many people do we have having age less than 25?

In [56]:
len(df[df["Age"]<25])

278

# 9. How many people of age less than 40 died?

In [58]:
len(df[(df["Age"]<40) & (df["Survived"]==0)])

322

# 10. From the cabin column separate Text and Numeric Value.

In [59]:
df["Cabin_Type"]=df["Cabin"].str[0:1]
df["Cabin_No"]=df["Cabin"].str[1:]

In [61]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SumSibPa,Sum_Sibsa_Parch,Sum_SibSp_Parch,Cabin_Type,Cabin_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1,1,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1,1,C,85
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,0,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1,1,C,123
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,0,NaN,NaN